[Oreans]

&New = 新增
&Open... = 開啟
&Save = 儲存
Save &As... = 另存為...
&Protect = 保護
&Help = 說明
About... = 關於...
Demo Version = 試用版
Save = 儲存

Options = 選項
Application Information = 應用程式訊息
Protection Options = 保護選項
Code Replace = 替換代碼
Virtual Machine = 虛擬機器器
Customized Dialogs = 自定義對話框
Advanced Options = 進階選項
XBundler = 打包
Help = 說明
Registration = 註冊
Trial Settings = 試用設置
Hardware Lock = 硬體鎖
Password Protection = 密碼保護
Soft&ware = 軟體
&Customers = 客戶
&License Manager = 授權管理
&Managers = 管理
&Project = 專案
Tools = 工具
H&elp = 幫助
&Contents = 內容
&About = 關於
Export Generators = 專家式生成
&Software = 軟體
&License = 授權
Password = 密碼
Trial Extension = 延長試用期
&Exit = 退出
P&rotect = 保護
Open Project = 開啟專案
New Project = 新增專案
Save Project = 儲存專案
Save Project As... = 專案另存為
Protect File = 保護檔案
Dupli&cate = 重覆
(Double click to select) = (雙擊選擇）


Application = 應用程式
Version = 版本
Input Filename = 輸入檔案名稱稱
Output Filename = 輸出檔案名稱稱
File Size = 檔案大小
File Information = 檔案訊息
Get from version info = 從版本訊息中取得
File not found = 沒有找到檔案
Refresh = 重新整理
Same as input = 儲存為輸入

Advanced Anti-Debugger = 進階的反調試
Enable Protection = 開啟保護
Advanced API-Wrapping = 進階的應用程式接口包裝
Anti Dumpers = 阻止傾倒
Entry Point Obfuscation = 混淆應用程式入口
Anti-Patching = 阻止修補
None = 沒有
File Patching = 檔案補丁
Compression = 壓縮
Resources = 資源監控
Monitor Blockers = 監控塊
Files Monitors = 監控檔案
Registry Monitors = 監控註冊表
Delphi/BCB Form Protection = delphi/BCB 表單保護
Memory Guard = 記憶體保護
Resources Encryption = 資源加密
VMWare/Virtual PC = VMWvare/虛擬機器器
Compatible = 相容
When Debugger Found = 當發現調試器時
Enable Encryption = 開啟加密
Display Message = 顯示訊息
Exit Silently = 後台推出
Crash Application = 崩潰的程式
Metamorph Security = 變形加密
Ring-0 Protection = Ring-0保護
(not available in DEMO) = 在試用版不可用

Import = 匯入
Export = 匯出
Reset Messages = 重置訊息

Global Caption = 全局標題
Debugger found = 發現調試器
Monitor software found = 發現監控軟體
Cracking tool found = 發現破解工具
File corrupted = 檔案損壞
(Not displayed in this version) = 在這個版本不顯示
Internal exception occured =  發現內部的一個異常
Virtual Machine Detected = 發現虛擬機器


Enable CodeReplace Technology = 允許代碼替換功能
Functions to remove using the CodeReplace Technology: = 使用代碼替換功能去除一個功能
Assembly code inside function: = 嵌入匯編代碼
Force simulation before protection = 在保護前強制模擬
Run with parameters = 用參數方法執行
Start Simulation = 開始模擬

Virtual API-Wrapper = 包裝虛擬機器 API
Imported DLLs: = 輸入的動態連接庫
Functions to Virtualize: = 虛擬化功能
API Virtualization Level: = API虛擬化等級
Processor Specifications = 處理器規格
Processor Type: = 處理器類型
Multiprocessor: = 多處理器
Opcode Type: = 操作碼類型
Dynamic Opcode: = 動態操作碼
VM Complexity: = 虛擬機器複雜化
VM size (aprox): = 虛擬機器大小
Execution Speed: = 執行速度
Entry Point Virtualization = 虛擬化入口
Multi Branch Technology = 多版本技術

Mutable CISC processor = 定長的CISC處理器
Mutable RISC-64 processor = 定長的RISC-64 位處理器
Mutable RISC-128 processor = 定長的RISC-128 位處理器
Mutable CISC-2 processor = 定長的CISC-2處理器

Static opcodes = 靜態的操作碼
Metamorphic - Level 1 = 變化等級1
Metamorphic - Level 2 = 變化等級2
Metamorphic - Level 3 = 變化等級3

Disabled = 不允許
20% Dynamic = 20%動態
40% Dynamic = 40%動態
60% Dynamic = 60%動態
80% Dynamic = 80%動態

Enable XBundler = 啟用 XBundler 
Make files visible to OpenDialog = 使檔案在開啟對話框中可見
Allow bundling from any directory = 允許從任何目錄綁定
AVI files support = 支持AVI檔案
Deleted extracted on exit = 當退出時刪除
Files to bundle: (drag files here) = 需要綁定的檔案（拖曳檔案到這裡）
XBundler Options = XBundler 選項
Add File = 添加檔案
Delete File = 刪除檔案

Filename = 檔案名稱
Write to disk? = 寫入到磁碟中?
Extraction Path (if written to disk) = 提取出路徑（寫入到磁碟中）


Encrypt Application = 加密應用程式
Protect as DLL Plugin = 像動態連接庫即插入一樣保護
Protect DLL plugin = 保護動態連接庫插入
Last Section Name = 最後段的名稱
.NET assemblies = .net 組件
Active Context = 活動的環境資料
Enable support = 啟用支持
Splash screen settings = 動態的畫面設置
Mouse Click to proceed = 滑鼠點擊處理
Display during a number of seconds = 在數秒內在數字上顯示

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = 此選項將要加密你的應用程式。除非調試需要你應該一直構選選此項

Check this option only if your protected DLL will be used as plugin in third party software. = 只有你的軟體作為第三方軟體，其需要保護時才需要檢查此項。

You can change the name of the last section added by Themida = 你可以改變由Themida加入的最後一段的名字

This option should always be enabled to protect your .NET assemblies = 這個選項應該一直開啟來保護你的 .NET組件

Support for Active Context based DLLs =  支持以Active Context為基礎的動態連結庫

Select a BMP-8 image that will be displayed when your application is launched = 選擇一個8位元的BMP圖片，當程式啟動時顯示它。

The user must click in the Splash Screen to continue running the protected application = 用戶必須點擊啟動畫面才能繼續執行保護的程式

The splash screen will be displayed for a custom number of seconds before continue running the protected application = 啟動畫面將在保護的應用程式執行和設定的時間顯示

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = 這個選項在Ring-0等級開啟試用版和序列號保護。 試用的訊息將儲存到系統中。當你檢查這一項時，一個設備驅動將會自動的解開這些訊息。請主要硬體的標識碼在這個選項開啟和關閉時時不一樣的。


Reading SDK Macros = 讀取SDK的巨集
Redirecting and Encrypting SDK Macros = 重新定位和加密SDK巨集
Merging sections / Preparing PE Header = 合併段/準備 PE的頭
Examining and Wrapping API Calls = 檢查和包裝API 調用
Generating Unique SecureEngine Code = 生產唯一的SecureEngine 編碼
Linking SecureEngine Code with Application = 關聯SecureEngine 到一個應用程式
Generating Unique Virtual Machine = 生產唯一的虛擬機器
Compressing Virtual Machine = 壓縮虛擬機器
Virtualizing VM / CodeReplace Macros = 虛擬化虛擬機器/代碼替換巨集
Compressing Application and Resources = 壓縮應用程式和資源
Encrypting Application and Resources = 加密應用程式和資源

Test Protected File = 測試保護的檔案
Protect = 保護
Cancel = 取消
Play sound when protection finishes = 請在保護結束時發出聲音

This option supervises at any time if your application is running under any kind of debugger. = 當你的程式被任何方式調試執行時，這個選項會在任何執行
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = 這個選項避免輸出記憶體訊息到磁碟上去，即使時很進階的記憶體訊息輸出工具。
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = 這個選項轉移和加密你的程式入口點。在一個很安全的入口地方執行你的程式。
This option will keep your application resources fully encrypted against modifications = 這個選項將儲存你的應用程式資源被加密而且不可以修改
If you want that your application will run inside VMWare/VirtualPC you must check this option = 你必須勾選這一項如果你想讓你的程式可以在VMWare/VirtualPC上執行。
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = 這個選項將包裝你的程式的APIs來避免你原來的程式被破解。
This option detects if any modification is done to your protected application, either by a cracker or a virus = 這個選項來檢查你的應用程式有沒有被病毒或者其它破壞者入侵
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = 這個選項將位單塊的程式激活內部的測定引擎來生成多字節碼的轉換
This option will protect your application against memory patching = 這個選項將保護你的程式不被記憶體補丁修補
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory = 這個選項可以讓你在發現調試工具或者破壞工具是做出你想要的選擇
This option keeps your application code compressed meanwhile it is not executed = 這個選項保持你的程式在沒有執行時時壓縮狀態。
This option keeps the resources in your application fully compressed = 這個選項儲存你的應用程式資源被完全的壓縮
This option will compress the SecureEngine code that is appended into your protected application = 這個選項將在你的保護程式中加入SecureEngine壓縮代碼。
This option will detect/fool possible files monitors when your protected application is running = 這個選項將會在你的程式執行時決定和欺騙可能的監控程式。
This option will detect/fool possible registry monitors when your protected application is running = 這個選項將會在你的程式執行時決定和欺騙可能的註冊辦監控程式。
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = 這個選項保護你的Delphi/BCB表單在記憶體中不被反解碼。請注意，這個選項可能與一些Delphi/BCB程式不相容
Load your customized messages from a file = 從檔案中匯入定制化的訊息
Save your customized messages to a file = 儲存定制化的訊息到一個檔案
This list displays all the DLLs imported by your application = 這個列表顯示了你所有匯入的DLLs
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = 這個列表顯示了你所有DLL。你可以選擇虛擬化哪個功能。
You can import API names from a text file. The imported APIs will be virtualized in the current project = 你可以從一個文本中匯入API名子。重要的API將會被虛擬化。
Select the maximun number of instructions to virtualize from your application entry point = 選擇在你的應用程式入口電中虛擬化時最大的指令數目。
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = 這個選項將在的的唯一的虛擬機器中插入多字節的多條件指令。使它很難分析。
You can save the current selected APIs into a text file to be imported by another project = 你可以儲存目前選中的APIs到一個文本檔案，然後匯入到其它專案
Complexity level to emulate each wrapped API = 模擬每個包裝API 的複雜度
Changes have been made. Do you want to save project? = 專案被改變了，你想儲存專案麼？
Save Changes = 儲存改變
*UNSAVED* = *沒有儲存*
Invalid Project File. Please, recreate a new one = 無效的專案檔案。請重新建立一個新的
Load Project = 匯入專案
You need XBundler .NET for your .NET application. Please contact info@oreans.com = 你需要XBundler .NET版本來保護你的.NET檔案，請聯繫info@oreans.com
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = 對不起，Themida 標準版本不支持.NET檔案，你需要升級到Themida 專業版本來支持.NET
Save Project = 儲存專案
Save Project As... = 專案另存為...
No file selected. Please select a file to protect (Input Filename) =  沒有選中檔案，請選中要保護的檔案（輸入檔案名稱）
No Output file selected. Please select an Output file before protecting = 沒有選中輸出檔案，請在做保護請選中輸出檔案
File does not exists: = 檔案不存在：
File is already protected/compressed: = 檔案已經被儲存
File has invalid macros insertion: = 檔案存在無效的巨集
Please, review your macros again = 請重新檢查你的巨集
File cannot be accessed for protection: = 不能訪問檔案在做保護
Please select a new file to protect (Input Filename) = 請選中要保護的檔案（輸入檔案名稱）
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = 檔案沒有被模擬化，請在保護前模擬化檔案或者勾選「強制在保護前模擬化」勾選框。
Open Input File = 開啟輸入檔案
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = 你程式中的資源段時空的。Themida 需要重新編譯你的應用程式頭部分，繼續？
Rebuild Header = 重新編譯頭部分
File is compressed or already protected: = 檔案被壓縮或者已經被保護：
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = 你的程式好像已經在記憶體中執行了，平確認在做保護前關閉它
Error = 錯誤
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = 你的應用程式頭部分與Themida不相容，你想Themida重新編譯你的應用程式頭部分？
.NET limitation = .NET限制
Sorry, you cannot change the global message caption in demo version = 對不起，你不能在試用版本中改變全局的訊息。
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = 警告：代碼替換巨集對於目前選中的檔案無效。代碼替換巨集被退出。
Warning = 警告
Warning! The current application is already protected/compressed. Do you still want to protect it? = 目前的應用程式已經被壓縮或者被保護，你想繼續保護麼？
File has a missing macro START or END: = 檔案缺少START 巨集或者END 巨集
Please review your macros again = 請重新檢查你的巨集
File cannot be opened: = 不能開啟檔案
Make sure that other application is not using it = 請確認其它的應用程式沒有在使用它
File to protect has an invalid PE header. Unable to inspect file = 想保護的檔案PE 頭無效，不能保護這個檔案
File to protect contains one macro with few lines of code on it. Please review your macros again = 要保護的檔案中存在一個巨集包含太少的代碼。請重新檢查你的巨集。
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = 對不起，目前版本的Themida不支持代碼替換功能在Visual Basic應用程式中使用
Sorry, the current version of Themida does not support CodeReplace in .NET applications = 對不起，目前版本的Themida不支持代碼替換功能在.NET應用程式中使用
Unable to find a function to add CodeReplace technology = 找不到方法來添加代碼替換技術
Run with parameters = 帶參數執行
Please enter the parameters = 請輸入參數
Sorry, you cant disable that option in demo version = 對不起，你不能在試用版本上關閉這個設置
Messages exported to = 訊息匯出到
Messages imported from = 訊息匯入到
Themida GUI Overview = Themida界面概括
Protect Now = 現在保護
SecureEngine Technology = SecureEngine技術
SecureEngine Macros = SecureEngine巨集
Code Replace = 代碼替換
Software Updates = 軟體更新
What is XBundler = 什麼是XBundler 
Using XBundler = 使用XBundler 

Scenarios for Using XBundler = 使用XBundler 的情況
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = ***錯誤：專案檔案不存在或者無效***（退出碼 1）
*** ERROR: File to protect does not exist. (Exit code 2) *** = ***錯誤：要保護的檔案不存在***（退出碼 2）
*** ERROR: File is already protected. (Exit code 3) *** = ***錯誤：檔案已經被保護了***（退出碼 3）
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = ***錯誤：SecureEngine 巨集，請檢查這些巨集***（退出碼 3）
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = ***錯誤：要保護的檔案打不開***（退出碼 2）
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = ***錯誤：啟動畫面的檔案不是256色，只有256色的圖片檔案才能正確的顯示***
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = ***錯誤：啟動畫面的檔案好像被壓縮了，只有沒有壓縮圖片檔案才能正確的顯示***
Macros found: = 發現巨集
*** Fatal error while protecting file. (Exit Code 5) *** = ***保護檔案是發生重大錯誤（退出碼 5）
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = ***錯誤（退出碼 6）
Generating Unique SecureEngine Code... = ***錯誤：
Linking SecureEngine Code with Application... = 連接SecureEngine 代碼到程式
done. = 完成
Encrypting Application and Resources... = 加密應用程式和資源...
Compressing Application and Resources... = 壓縮應用程式和資源...
Macros processed: = 處理了巨集

processed: 處理完成
Application successfully protected. = 成功地保護了應用程式
Do you want to go to the order form Themida subscription plans? = 你想轉到Themida 的計劃表單碼？
No file selected. Please, select a file to protect (Input Filename) = 沒有選中檔案，請選中要保護的檔案（輸入檔案名稱）
Question = 問題
-- Files to Bundle -- = --打包的檔案--
The path of the file that you are inserting must be relative to: = 你輸入的檔案路徑必須相關：
All imported by ordinal! = 所以的都被匯入成功
Medium = 中等的
Normal = 中等的
High = 高的
Supreme = 極高的
Extreme = 極端的高的
Highest = 最高的

This option is not enabled in DEMO version = 這個選項在試用版本不可用
DEMO Restriction = 試用版本註冊
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = 啟動畫面的檔案不是256色，只有256色的圖片檔案才能正確的顯示
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = 啟動畫面的檔案好像被壓縮了，只有沒有壓縮圖片檔案才能正確的顯示
Sorry, Themida DEMO does not support RISC-128 processors = 對不起，Themida 試用版本不支持RISC-128處理器
Processor Type = 處理器類型
Sorry, Themida DEMO does not support Dynamic Opcodes = 對不起，Themida 試用版本不支持動態操作碼
The file is never extracted to disk! = 這個檔案從來沒有被匯出到硬碟中
Select file/s to bundle = 選擇打包的檔案
No file selected. Please, select a file to protect (Input Filename) = 沒有選中檔案，請選中要保護的檔案（輸入檔案名稱）
Last Modified: = 最後修改者：
(Application header has been rebuilt by Themida) = 檔案類型：應用程式頭被Themida重新編譯
File Type: Windows Standard Executable = 檔案類型：Windows 標準應用程式
File Type: Visual Basic Native Executable = 檔案類型：Visual Basic 本地應用程式
File Type: Visual Basic PCode Executable = 檔案類型：Visual Basic 機器碼應用程式
File Type: Windows .NET Executable = 檔案類型：Windows .NET應用程式
File Type: MACROMEDIA Executable = 檔案類型：MACROMEDIA應用程式
File Type: PowerBuilder Application = 檔案類型：PowerBuilder應用程式
File Type: Excelsior JET Application = 檔案類型：Excelsior JET應用程式
File Type: Dynamic Link Library (DLL) = 檔案類型：動態連結庫(DLL)
File Type: OLE Control Extension (OCX) File = 檔案類型：OLE控件擴展檔案(OCX)
File Type: Screensaver File = 螢幕檔案類型：
File Type: Windows NT Service = Windows NT服務檔案類型：
File Type: Borland Library = 檔案類型：Borland 庫
File Type: Linux Executable (ELF/i386) = 檔案類型：Linux應用程式(ELF/i386)
File Type: NT Device Driver = 檔案類型：NT設備驅動檔案

*** Protected with Code Virtualizer *** = ***使用虛擬化器進行保護***
Virtual Machine Macro Functions: = 虛擬機器巨集方法
CodeReplace Macro Functions: = 代碼替換巨集方法
CodeEncrypt Macro Functions: = 代碼加密巨集方法
ClearCode Macro Functions: = 清除代碼巨集方法
Registered Macro Functions: = 註冊巨集方法
Unregistered Macro Functions: = 取消註冊巨集方法
Read functions automatically = 自動地讀取方法
Read functions from SDK = 從SDK中讀取方法
File already protected/compressed. = 檔案已經被保護/壓縮
Error: There is a missing START or END in one of your macros. = 錯誤：檔案中的一個巨集中缺少START 或者END
Error: Unable to open the selected file. File may be in use. = 錯誤：不能開啟所選擇的檔案，可能這個檔案正在被使用中
Error: Invalid PE header in selected file. = 錯誤：所選擇的檔案無效的PE（應用程式)頭段
Error: The included code inside a macro is too small. = 錯誤：目前的巨集中的所包含代碼太少
Error: There are at least a nested VM macros. VM macros cannot be nested. = 錯誤：至少包括一個本地的虛擬機器巨集，虛擬機器巨集不能被本地化的
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. =錯誤：選擇的檔案不是64位應用程式。你需要用Themida 32位來保護你的應用程式。 
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = 錯誤：選擇的檔案是64位應用程式。你需要用Themida 64位版本來保護你的應用程式。 
Project: = 專案
Select functions from MAP file = 從映射檔案中選擇方法
Read functions automatically = 自動讀取方法
How many functions do you want to add? = 你想加入多少的方法
OK = 確認
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = 沒有找到映射檔案請為你的應用程式生成映射檔案
There are not functions to simulate. Please, insert some functions either manually or automatically = 在模擬器中沒有找到方法，請手動或者自動的插入方法
Simulator = 模擬器
Information = 訊息
None = 沒有
Message = 訊息
Customize Dialog = 定制化對話框
Close = 關閉

Internal Protection Messages = 內部的保護訊息
Trial/Registration Messages = 試用/註冊訊息
Will be displayed by WinLicense = 將會被WinLicense來顯示
Displayed by SDK or not displayed = 將會被SDK來顯示或者不顯示
Cannot update oreans.sys driver (admin rights) = 不能更新oreans.sys驅動（管理員權限）
Cannot open oreans.vxd driver (already in use) = 不能開啟oreans.vxd驅動（已經在使用中）
Driver cannot be updated = 驅動不能被更新
Computer needs to be reset to install driver = 需要重新啟動機器或者安裝驅動
Cannot write oreans.vxd (already in use) = 不能寫oreans.vxd驅動（已經在使用中）

Trial nag screen (reminder) = 試用版界面（提醒）
Trial days expired = 試用版天數過期
Trial executions expired = 試用版延長過期
Trial date expired = 試用版時間過期
Trial runtime expired = 試用版執行時過期
Trial global time expired = 試用版全局時間過期
Trial locked to different country = 試用版鎖定了不同的國家
Trial extension key corrupted = 試用版本序列號錯誤
No more trial extensions allowed = 不能在延長試用版本
Show registration info (only first time when registered) = 顯示註冊訊息（只是時第一次顯示）
License days expired = 序列號天數過期
License executions expired = 序列號延長過期
License date expired = 序列號天數過期
License global time expired = 序列號全局時間過期
License key corrupted = 序列號錯誤
License locked to different machine = 序列號鎖定到不同的機器
License without machine locking = 序列號沒有機器鎖
No more hardware changes allowed = 不允許再改變硬體
Stolen license key = 假的序列號
License is not expirable = 序列號沒有過期
License required to run = 需要序列號來執行
Trial/Licensing Manager manipulated = 試用版/序列號管理器時盜版
Invalid user/password (for password dialog) = 無效的用戶名/密碼（對於密碼框）

This application(s) will run in trial/restricted mode, until registered. = 應用程式執行再試用/限制模實，一直到註冊
Days Expiration = 天數過期
Date Expiration = 時間過期
Executions = 執行
Run Time (execution) =執行時（執行） 
Global Time = 全局時間
days = 天數
times = 時間
minutes = 分鐘
Unlimited = 無限制
(For custom restrictions) = （對客戶限制）
Trial Restrictions = 試用版限制
Clock Change = 改變時間
Trial Extension = 試用版延長
Lock trial to user language = 說道試用版用戶語言
Allow trial period to be extended (with a valid key) =允許延長試用版本的時間（使用有效的序列號） 
Extension Key distribution options = 延長序列號時間選項
With single file = 使用單個檔案
With Registry = 使用註冊
Value Name = 值名稱
Maximum Extensions = 最長的延長期
Maximum extensions allowed = 允許最長的延長期

This option sets a trial period to a certain amount of days since the application is started for the first time = 這個選項設定試用版的試用天數，從第一次允許程式來計算
This option sets an exact date for the end of the trial period = 這個選項準確地設定試用版本的過期時間
This option sets an exact number of executions allowed for an application = 這個選項準確地設定允許延期的次數
This option sets an exact amount of time (in minutes) that an application can stay in memory = 這個選項準確地設定應用程式允許再記憶體中執行的時間（分鐘）
This option sets an exact amount of total time (in minutes) that an application can run during all WindowsR sessions =這個選項準確地設定應用程式總共可以允許執行的時間（分鐘）
This option allows an application to run in trial mode without any restrictions added by WinLicense = 這個選項準確地設定試用模式下應用程式可以沒有任何的限制執行
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = 你可以設定WinLicense 的相對於時鐘的靈敏度。例如「1天」，WinLicense將會忽視在1天內的時間改變。
This option allows an application to be locked to specific country when it runs in trial mode = 這個選項允許在試用模式下鎖定特定的國家
This option allows you to extend the trial period of your application with special trial extension keys = 這個選項允許試用延期的序列號來延長試用版的使用時間
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = 這個選項設定在應用程式執行時WinLicense 設定試用延長檔案的名稱
This option is used to allow distribution of extension keys as WindowsR Registry key files = 這個選項允許使用WindowsR 的註冊表來分發序列號
This option limits the amount of trial extensions that an application can be extended = 這個選項準確地設定允許延期的次數

Any clock change = 任何時間的改變
1 hour clock back = 1小時回退
1 day clock back = 1天回退

This application(s) can be registered, with the presence of a valid key. = 這個應用程式可以註冊，目前是一個有效的序列號
License Keys Accepted = 接受序列號
Types of accepted License Keys = 序列號的類型
Single file = 單個檔案
Registry = 註冊表
Security Options = 安全選項
Enable SmartActivateR System for user-side generated keys. = 啟用對於用戶生成的序列號智能激活
Allow only hardware dependent (locked) registrations. = 允許只是硬體（鎖）的依賴註冊
Accept only temporary keys (that expire). = 只接受臨時的序列號（過期情況下）
Application only runs when registered. (Requires a key to run) = 應用程式只有在註冊後才能執行（需要一個序列號來允許）
Clear trial info when registered. = 當註冊時清除使用版本訊息
License Key Signature = 序列號簽署
Level 1 = 等級1
Level 2 = 等級2
For professional and elegant licensing control, WinLicense offers the SmartActivateR System. This technology allows an application to be registered using SmartActivateR keys = 為了提供專業的序列號控制，WinLicense提供了智能激活R系統，這項技術允許使用智能激活R系統來註冊序列號
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = 這個選項限制序列號只能在Ð一個特定的機器（處理器類型，硬碟，啟動碼）上來執行，WinLicense 可以鎖定序列號到特定的機器。
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = 這個選項拒絕使用「沒有時間限制」的序列號，而且強制WinLicense 來接受臨時的序列號
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = 這個選項強制應用程式執行在合法的序列號情形下，如果時非法的話，WinLicense 將會退出程式
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = 這個選項的目的時在註冊正式的序列號後清除使用版本的訊息，如果用戶去除註冊訊息或者過期的話，試用版將重新啟動並且從0開始計算
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = 這個選項允許你來選擇一個簽署的等級，WinLicense 使用它來檢查你的應用程式。

Enable Password Protection = 啟用密碼保護
Password requirement = 需要密碼
Password Action = 密碼操作
Encrypt EXE using the password hash. = 使用密碼的哈希數值來加密可執行程式
On Normal / Trial Version = 在普通版 / 試用版
On Registered Version = 已註冊版
Never ask for a password. = 從不詢問密碼
I will ask for a password manually. = 將手工地請求密碼
Automatically, ask for a password only the first time. = 自動的，在第一次詢問密碼
Automatically, always ask for a password. = 自動的，一直詢問密碼

Hardware Lock = 硬體鎖
Custom Hardware Items =客戶硬體條目 
Hardware Items = 硬體條目
All hardware items = 所有硬體條目
CPU = CPU
BIOS =  BIOS
MAC Address = MAC網卡的地址
HDD Serial = HDD硬碟的序列號
Allowed CPU changes = 允許替換CPU
Allowed BIOS changes = 允許替換BIOS
Allowed NIC changes = 允許替換NIC
Splash settings = 啟動畫面設置

Keep Trial Running = 保持試用版執行
Keep running = 保持一直執行
Launch Application when Trial Expired = 當試用版過期時執行應用程式
Launch Application = 執行應用程式
Application Name: = 應用程式名稱
Enable Custom Event = 啟用客戶事件
Export Specific Generators = 匯出特定的生成器
Event Name: = 事件名稱：
Export Generators = 匯出生成器
Custom Event = 客戶事件
This option will export a specific license generator when your application is being protected = 這個選項將在應用程式保護時匯出一個特定的序列號生成器
This option will run an external application when the trial period in your application has expired. = 這個選項設定在你的試用版應用程式過期時執行一個額外的程式。
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. =  你可以自定義事件來拒絕在同一時間初始化保護應用程式。這個選項同樣適合在你的應用程式在分鐘的時間內被多次執行
Check this option if you want that your application continues running in trial mode if an invalid license key is present. =當你想在你的應用程式在試用模式時遇到一個無效的序列號還想繼續執行，請檢查這個選項  
*** Demo Version *** = ***試用版***
Destroy Exports section = 銷毀匯出段
This option will destroy the export table of your DLL control for maximum security = 為了最好的安全這個選項將會銷毀你的動態連接庫匯出的表
Select specific functions from your DLL to handle each event = 在你的動態連接庫中為每個事件選擇一個處理者
DLL Control file = 動態連接庫控制檔案

Export specific generators to App. folder = 匯出特定的生成器到資料夾
Trial in debug mode (for testing purposes) = 試用版在調試模方式（為了測試）
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = 如果你想定制話序列號生成器來保護你的程式，請檢查這個選項。 生成器將會在的應用程式目錄建立一個子資料夾
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = 僅當你想發佈的的保護程式時才不勾選這一項，勾選這一項來避免在試用狀態時儲存不必要的訊息到你的機器上去

&Add = 添加
&Edit = 修改
&Delete = 刪除
Name = 名稱
Company = 公司
Total Customers: = 總共的客戶
New Customer = 新增客戶
Edit Customer = 編輯客戶
Delete Customer = 刪除客戶
Customers = 客戶
Extra Details = 匯出詳細訊息
Add Customer = 添加客戶
Update = 更新
Filename = 檔案名稱
Version = 版本
Total Software: = 總共的軟體：
Do you want to delete this software? = 你想刪除這個軟體嗎？
Confirm = 確認
Add Software =增加軟體 
Edit Software = 編輯軟體
Delete Software = 刪除軟體
Duplicate Software = 相同的軟體
(leave blank to use the same input and output filename) = 空的話表示使用相同的輸入輸出名
Input File Type = 輸入檔案類型
License Unique Key = 序列號唯一的標誌符
Trial Unique Key =  使用版本的序列號
Password Unique Key =  密碼的唯一標誌符
Windows Standard Executable (EXE) = Windows 標準應用程式
Dynamic Link Library (DLL) = 動態連結庫（DLL)
OLE Control Extension (OCX) = OLE控件擴展檔案（OCX)
Windows .NET Executable = Windows .NET應用程式
Windows NT/XP Service = Windows NT/XP服務
Screensaver File (SCR) = 螢幕檔案(SCR)
Copy Software = 拷貝軟體
Reg Unique Key missing. Please, select one. = 缺少註冊表序列號，請選擇一個
Software Manager = 軟體管理器
Sofware name missing. Please, select one. = 缺少軟體，請選擇一個 
Reg Unique Key is too short. Please, select a new unique key. = 註冊表序列號太短，請選擇一個
Trial Unique Key missing. Please, select one. = 缺少試用版序列號，請選擇一個
Trial Unique Key is too short. Please, select a new unique key. = 缺少試用版序列號太短，請選擇一個
Pass Unique Key missing. Please, select one. = 缺少序列號，請選擇一個
Pass Unique Key is too short. Please, select a new unique key. = 序列號太短，請選擇不同的一個
The software already exists in database. Please, choose a new software name or version. = 這個軟體已經在數據庫中存在了，請重新選擇一個或者選擇新的版本。
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = 新的序列號哈希數值將被生成，之前的就的序列號將實效，繼續嗎？
Duplicated Software = 相同的軟體
File cannot be opened. Make sure the application is not running or being used. = 找不到檔案，請確認程式沒有在執行或使用
Protection Error = 保護出錯
Protect Error = 保護出錯
File is compressed or already protected. = 檔案被壓縮或者已經被保護
File has a missing macro START or END. Please correct this error before protecting. = 檔案中缺少START 或者END巨集，請在保護前修復這個錯誤
File cannot be opened. Make sure that other application is not using it. = 檔案打不開，請確認程式沒有在執行或使用
File has an invalid PE header. Unable to protect. = 檔案的PE頭無效，不能保護
File contains one macro with few lines of code on it. Please review your macros before protecting. = 檔案中存在一個巨集包括了太少的代碼，請在做保護前檢查你的巨集
File seems to be in use. Please, close the file to proceed with protection. = 檔案可能在使用，請確認程式沒有在執行或使用
The splash file does not exist. = 啟動畫面的檔案不存在
Splash = 啟動
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = 啟動畫面的檔案不是256色，只有256色的圖片檔案才能正確的顯示
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = 啟動畫面的檔案好像被壓縮了，只有沒有壓縮圖片檔案才能正確的顯示
Do you want to cancel the protection process? = 你想停止退出保護的進程嗎？
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = 檔案打不開不能寫檔案，請確認程式沒有在執行或使用
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = 不能寫保護的檔案到硬碟中去，請確認你有寫的權限和硬碟裡有足夠的空間
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode = 對不起，試用版本只能在調試的模式下來做保護
WinLicense DEMO = WinLicense試用版

&Add License = 添加序列號
&Edit License = 編輯序列號
&Delete License = 刪除序列號
Create License Key = 生成序列號
Mark as Stolen = 標記為盜用號
Unmark Stolen = 清除盜用號標誌
Stolen = 盜用
Ban Hardware IDs = 硬體的標識碼
Please make a selection... = 請選擇一項
License Details = 序列號詳細訊息
License Generation = 序列號生成器
Hardware ID = 硬體的標識碼
Custom Data = 客戶數據
Key Type = 鍵類型
Country Locking = 國家鎖
Store generated Licenses in folder: = 儲存生成好的序列號到資料夾
Generate File Key = 生存檔案序列號
Generate Registry Key = 生成註冊表序列號
Generate Text Key = 生成文本序列號
Generate SmartActivate Key = 生成智能序列號

Total Software: = 全部軟體
All = 全部
Please make a selection... = 請選擇一項
Nothing selected. = 沒有一項被選中
Selection: = 選項
Software: = 軟體
Do you want to mark the current key as stolen? = 你想標記目前的序列號為盜用號嗎？
Stolen Keys = 盜用號
Do you want to unmark the current key from being stolen? = 你想清除之前標記為盜用號的序列號嗎？
Do you want to delete this license? = 你想刪除這個序列號麼
Warning: The generated keys will have the settings from the current project. Proceed? = 警告：生成的序列號將要應用到目前的專案中，確認？
Generate License = 生成序列號
Cannot create directory: = 不能生成字典
Please, select which type of license you want to generate = 請選擇你想生成哪種類型的序列號
Keys successfully generated in folder: = 序列號成功的生成在資料夾下
Please, first select a valid application to protect = 請首先選擇有效的應用程式來保護
Ban Hardware Id = 硬體標誌符

License Restrictions = 受限制的序列號
Customer = 客戶
Software = 軟體
Save = 儲存
Edit License = 編輯序列號
Add License = 添加序列號
Please, select a customer from database. = 請從數據庫中選擇客戶
License Manager = 序列號管理
Please, select a software from database. = 請從數據庫中選擇軟體
Please, insert a Hardware ID for verification = 請輸入硬體標誌符來驗證
The inserted Hardware ID is valid = 輸入的硬體標誌符是有效的
Invalid Hardware ID inserted = 無效的硬體標誌符
Another instance of WinLicense is running = 有另外一個WinLicense程式在執行
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry) Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = 你應該啟用SmartActivate 序列號，但是你沒有選中任何一現你接受的序列號（單個檔案或者註冊表），請記住你應該使用WLRegSmartKeyInstallToFile 或者WLRegSmartKeyInstallToRegistry 來
File has not being simulated: = 檔案沒有被模擬
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = 請在保護或者取消選項「在保護前強制模擬」選項前模擬一個檔案
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = 警告：你的應用程式已經註冊一個無效的序列號，但是你不應該去選擇一個新的序列號，如果你繼續操作的話你的應用程式將不能再被註冊，繼續？
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = 警告：你的應用程式已經註冊一個使用版本的序列號，但是你不應該使用任何方式去延長試用期，如果你繼續操作的話你的應用程式將不能再被延長試用，繼續？
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = 你的應用程式開頭與WinLicense不相容，你希望用WinLicense重新建立你的應用程式開頭嗎？
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = 對不起，WinLicense 標準版不能保護.NET檔案，你想更新到WinLicense 專業版來支持.NET檔案嗎？現在更新？
Note: CodeReplace has been added into your application = 註解：代碼替換功能已經加入到你的應用程式中
(Application header has been rebuilt by WinLicense) = （應用程式開頭部分已經被WinLicense重新編譯）
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = 錯誤：選擇的檔案不是一個64位應用程式。你需要用WinLicense x32來保護你的應用程式。
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = 錯誤：選擇的檔案是一個64位應用程式。你需要用WinLicense 64位來保護你的應用程式。
Sorry, the MAP file was not found: = 對不起，沒有找到映射檔案：
Please, generate a MAP file for your application = 請為你的應用程式生成映射檔案
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = 對不起，目前的WinLicense不支持在Visual Basic應用程式中使用代碼替換功能
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = 對不起，目前的WinLicense不支持在.NET應用程式中使用代碼替換功能
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = 在模擬器中有部分功能進階地執行了，有部分功能沒有執行，你想不選擇這些功能嗎？
There are some functions highly executed in simulation. Do you want to unselect those functions? = 在模擬器中有部分功能進階地執行了，你想不選擇這些功能嗎？
There are some functions not executed in simulation. Do you want to unselect those functions? = 在模擬器中有部分功能沒有被執行，你想不選擇這些功能嗎？
Messages exported to: = 訊息 匯出到
Messages imported from: = 訊息 匯入到
WinLicense GUI Overview = WinLicense 界面總體概括
Trial Settings = 試用設置
Trial SDK = 試驗SDK
Registration SDK = 註冊SDK
Password Protection = 密碼保護
Miscellaneous SDK = 混淆SDK
Hardware Lock = 硬體鎖
WARNING: Protected in Trial Debug Mode = 警告：在試用的調試版本下保護
Click and select here = 點擊以及選中這裡
ERROR: None of the functions handlers where specified in DLL Control = 錯誤：在動態連接庫中沒有說明函數句柄
Sorry, WinLicense DEMO does not support RISC-128 processors = 對不起，WinLicense 試用版本不支持RISC-128處理器
Sorry, WinLicense DEMO does not support Dynamic Opcodes = 對不起，WinLicense 試用版本不支持動態的操作碼
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = 目前的軟體等級2簽署沒有被接受。請到軟體的控制台中重新為你的軟體建立新的序列號的哈希數值
.NET Module = .NET模組
File has a missing macro START or END. Please review your macros again: = 檔案中缺少START 或者END巨集，請重新檢查你的巨集：
File cannot be opened. Make sure that other application is not using it: = 檔案不能被開啟，請確認沒有其他應用程式在使用它
File has an invalid PE header. Unable to inspect file: = 檔案包含了無效的PE頭，無法檢查這個檔案：
File contains one macro with few lines of code on it. Please review your macros again: = 檔案中存在一個巨集中包括了一些代碼，請重新檢查你的巨集
Deep file analysis in progress = 在進行深度的檔案分析
File analysis in progress = 在進行檔案分析
Please wait... = 請稍候
Analyzing CodeReplace macros = 分析代碼替換巨集
Are you sure you want to remove the selected Hardware ID? = 你確定你想去除選中的硬體標誌符
List of Banned  Hardware IDs: = 列出被禁止的硬體標誌符
Add = 添加
Remove = 刪除
Done = 完成
Generating License Hash = 生成序列號的哈希數值
Generate Password = 生成密碼
Password Generation = 密碼生成
Store generated Passwords in folder: =在資料夾中儲存生成的密碼 
Total Passwords: = 總共的密碼：
Do you want to delete the selected record? = 你想刪除選中的記錄嗎
Password file generated in folder: = 密碼已經在資料夾中生成了
Password Generator = 密碼生成器
Password Manager = 密碼管理
Details = 詳細訊息

Add Password = 添加密碼
Edit Password = 編輯密碼
Please, select a customer to generate the password = 請選擇一個客戶來生成密碼
Please, select a software to generate the password = 請選擇一個軟體來生成密碼
Rolling back your actions = 回退你的操作

Generate Extension = 延長生成
Level = 等級
Trial Extension Generation = 試用延長生成器
Store generated Extensions in folder: = 儲存生成號的延長到資料夾中
Generate File Key = 生成檔案序列號
Generate Registry Key = 生成註冊表序列號
Trial extension key/s generated in folder: = 試用版的延長序列號生成在資料夾中
Trial Extension Generator = 試用版的延長生成器
Edit = 編輯
Add Trial Extension = 添加試用延長
Edit Trial Extension = 編輯試用延長
Please, select a software to generate the trial extension = 請選擇一個軟體來生成延長試用

Warning: Trial in Debug Mode = 警告：試用在調試模式
Debug Mode Trial = 調試模式試用
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = 你將要保護的軟體不包括試用的安全引擎管理。 
The trial information will be stored under the registry key: = 沒有在註冊表下儲存試用的訊息：
(You can access to that key to reset/test the WinLicense Trial Engine) = 你可以訪問那個序列號來重置或者測試WinLicense 試用引擎
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = 請在保護的頁面上構選「在調試版本下試用」來開啟安全引擎管理功能
Don't show this screen again = 下次不在顯示這個畫面

Do you want to delete the selected client? = 你想刪除目前選擇的客戶端麼？
Enter new Hardware ID to ban: = 請輸入新的被禁止的硬體標誌碼：
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = 輸入的硬體標識碼不合法(必須至少32個字符）請輸入一個有效的標誌符

File has a missing macro START or END. Please correct this error before protecting: = 檔案中缺少START 或者END巨集，請在做保護前修復好錯誤：
File has an invalid PE header. Unable to protect: = 檔案包含了無效的PE頭，無法被保護：
File contains one macro with few lines of code on it. Please review your macros before protecting: = 檔案中存在一個巨集中包括了一些代碼，請在做保護前重新檢查你的巨集
The input file seems to be in use. Please, close the file to proceed with protection: = 輸入的檔案好像在使用中，請關閉檔案來處理保護

Code Virtualization = 代碼虛擬化
Virtual Opcodes Obfuscation = 虛擬的操作碼混淆
Current: = 目前的：
Virtual Machine Complexity = 虛擬機器器複雜化
Size (Approx): = 大小（估計數值）
Opcodes Mutation = 操作碼轉換
Multiple Virtual Machines = 多字節的虛擬機器
NumVMs * SizeVM: = 虛擬機器個數×虛擬機器大小
Fake Stack Emulation =欺騙堆棧模擬 
Strip Relocations (EXEs) = 去除重新定位（可執行檔案)
Strip relocations = 去除重新定位
Re-Virtualization = 重新虛擬化
Multi Branch Technology = 多分支技術
Fake Emulation = 欺騙模擬器
Keep original name = 保持原始名稱
Functions that will be virtualized: =功能將要被虛擬化 

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = 你可以定制虛擬機器操作的複雜程度，生成好的操作碼大小與設定的複雜程度相關
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = 你可以定制虛擬機器操作的複雜程度，生成好的操作碼大小與設定的複雜程度相關
You can mutate the internal virtual opcodes, generating a more complex virtual machine = 你可以變換內部的虛擬操作碼，生成更複雜的虛擬機器
The generad Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = 生成好的虛擬機器和虛擬操作碼被放在最後你的應用程式的最後一端，你可以重新設置你的你想要的最後一段的名稱
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = 你可以在你的應用程式中建立一些虛擬機器，沒一個虛擬機器來處理你所設定的每一塊
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = 這個選項將假定你所有堆棧上的實體被初始化為0，這個選項在PureBasic 應用程式中應該被開啟
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = 你可以在PE的頭塊上去除重新定位的段，來減少你最終保護程式的大小
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization =重新虛擬化對於保護逆向專案是一個非常有用的技術。 但是它會在保護的塊上降低它的性能。請對於使用了重新虛擬化的塊進行重新性能測試。
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = 這個選項將在的的唯一的虛擬機器中插入多字節的多條件指令。使它很難分析。

Please, select an application to protect = 請選擇需要保護的程式
The selected application does not have any functions to virtualize. Please insert functions using the SDK =你所選擇的程式沒有任何功能來被虛擬化，請使用SDK來添加功能。 
All functions to virtualize were disabled. Please, select at least one = 所有虛擬化的功能都被禁止了，請至少選擇一項
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = 警告！發現一個沒有代碼的巨集。這可能是由於編譯器優化的原因。請關閉編譯器優化器或者重新檢查所有的巨集。
Virtual Functions = 虛擬的功能
Inserted via "Call VarPtr": = 通過「調用VarPtr」來插入
Inserted via inline Assembly: = 通過「內聯彙編」來插入
Inserted via auxiliar API: = 通過「幫助API」來插入
Inserted via MAP file: = 通過「映射檔案」來插入
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = 沒有發現可以虛擬化的功能
(Application header has been rebuilt by Code Virtualizer) = 程式頭部被虛擬化器重新編譯了
Protecting an Application = 保護一個應用程式
Learn About Virtualizer = 學習虛擬化器
Code Virtualization = 代碼虛擬化
Code Virtualize Macros = 代碼虛擬化巨集
**** Sorry, the DEMO version does not support protection via command line **** = ****對不起使用版本不支持命令行方式保護****
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = ***錯誤：不能訪問被保護的檔案（退出碼2)***
*** ERROR: File does not have any blocks to protect. (Exit code 3) ***  ***錯誤：檔案沒有可以保護的塊（退出碼3）***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = ***錯誤：不能開啟被保護的檔案（退出碼5）***
Generating Specific Virtual Machine = 生成特定的虛擬機器
Virtualizing Function = 虛擬化的方法
Re-Virtualizing ... = 重新虛擬化...
Flushing file ... = 整平檔案...
Sorry, the DEMO version only allows one Virtual Machine per application = 對不起，試用版只允許一個程式使用一個虛擬機器
Sorry, the DEMO version does not support Re-Virtualization = 對不起，試用版不支持重新虛擬化
The application is already protected. You cannot protect an already protected application in the DEMO version = 這個應用程式已經被保護了，這使用版本中不能保護一個已經被保護的檔案
The Input application cannot be accessed. Please, check that the application is not in use: = 不能訪問輸入的檔案，請檢查這個檔案是不是在使用中：
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = 不能訪問輸出的檔案，請檢查這個檔案是不是在使用中或者應用程式路徑是否有效：
Limitations in DEMO version: = 使用版本中的限制：
Virtual Opcodes Obfuscation set to NORMAL = 虛擬操作碼混淆設置為普通等級
Virtual Machine Complexity set to NORMAL = 虛擬機器複雜度設置為普通等級
Only ONE macro is virtualized = 只有一個巨集被虛擬化
The Output application cannot be accessed. Please, check that the application is not in use: = 不能訪問輸出的檔案，請檢查這個檔案是不是在使用中：
PE Information = PE（應用程式）訊息
Input PE file: = 輸入PE（應用程式）檔案
Output PE file: = 輸出PE（應用程式）檔案
Virtual Functions found: = 發現虛擬的方法
PE file analysis... OK! = PE（應用程式）分析...成功！
Virtualization = 虛擬化
Generating Specific Virtual Machine = 生成特定的虛擬機器
Size: = 大小：
Virtualizing Function = 虛擬化的方法
Start: = 開始：
Skipped = 跳過
bytes = 字節
Cancelling... = 取消
Re-Virtualization = 重新虛擬化
Re-Virtualizing ... = 重新虛擬化
Final Stats = 最終狀態
Virtualized Functions: = 虛擬化方法：
Skipped Functions: = 跳過方法：
Errors: = 錯誤：
Increase in size: = 增加的大小：
Application successfully protected! = ：保護程式成功
Protection CANCELLED! = 取消了保護
Do you really want to Cancel the protection process? = 你真的的取消保護進程嗎？
Cancel Protection = 取消保護
Select a Software to protect from the WinLicense database = 從WinLicense 數據庫中選擇所要保護的軟體

